## Pandas DataFrame Oluşturma

In [2]:
import pandas as pd

In [3]:
l=[1,2,66,67,90]

In [4]:
l

[1, 2, 66, 67, 90]

In [5]:
pd.DataFrame(l,columns=["değişken_ismi"]) #tek boyutlu

   değişken_ismi
0              1
1              2
2             66
3             67
4             90

In [9]:
import numpy as np
m=np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [10]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [11]:
#DataFrame İsimlendirme

In [14]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [15]:
df.columns=("d1","d2","d3")

In [16]:
df

   d1  d2  d3
0   1   2   3
1   4   5   6
2   7   8   9

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df.axes #index bilgisi

[RangeIndex(start=0, stop=3, step=1),
 Index(['d1', 'd2', 'd3'], dtype='object')]

In [19]:
df.shape #boyut bilgisi

(3, 3)

In [20]:
df.ndim # boyut

2

In [21]:
df.size # eleman sayısı

9

In [22]:
df.values # değerler

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
type(df.values) #dataframe deki değerleri çekip numpy arrayine çevirdi

numpy.ndarray

In [24]:
df.head()

   d1  d2  d3
0   1   2   3
1   4   5   6
2   7   8   9

In [25]:
df.tail()

   d1  d2  d3
0   1   2   3
1   4   5   6
2   7   8   9

In [26]:
a=np.array([1,2,3,4,5])

In [28]:
df=pd.DataFrame(a,columns=["değ1"])

In [29]:
df

   değ1
0     1
1     2
2     3
3     4
4     5

## Pandas DataFrame Eleman İşlemleri

In [30]:
import numpy as np
s1=np.random.randint(0,10,size=5)
s2=np.random.randint(0,10,size=5)
s3=np.random.randint(0,10,size=5)

In [31]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [32]:
sozluk

{'var1': array([8, 8, 5, 9, 6]),
 'var2': array([1, 6, 7, 6, 6]),
 'var3': array([2, 6, 3, 1, 7])}

In [34]:
df=pd.DataFrame(sozluk)
df

   var1  var2  var3
0     8     1     2
1     8     6     6
2     5     7     3
3     9     6     1
4     6     6     7

In [35]:
df[:3]

   var1  var2  var3
0     8     1     2
1     8     6     6
2     5     7     3

In [36]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [45]:

#Pandas DataFrame’de index değerleri genelde sıralı ve ardışık (örneğin 0, 1, 2, 3…) olur. 
#Ancak biz df.index = np.arange(10, 19, 2) koduyla index değerlerini 10, 12, 14, 16, 18 olarak değiştirmiştik. 
#Bu durumda indexler arasında boşluklar var (örneğin 11, 13, 15 yok).

"""df[10:14] yazdığında Pandas, sıralı ve ardışık indexlere göre işlem yapmayı bekler.
Fakat indexlerin sıralı olsa da ardışık (birer birer artan) olmadığı için bu şekilde slicing (10:14) çalışmaz.
Bunun yerine, indexleri kullanarak satırlara doğrudan erişmek için
.loc yöntemini kullanman gerekir."""

#Örneğin:
#df.loc[10:14]
#Bu ifade, index değerlerine göre çalışır ve 10 ile 14 arasında olanları (varsa) seçer. 
#Ancak 10:14 slicing’de eksik indexler varsa bu hata almaz, sadece geçerli olanları getirir.

'df[10:14] yazdığında Pandas, sıralı ve ardışık indexlere göre işlem yapmayı bekler.\nFakat indexlerin sıralı olsa da ardışık (birer birer artan) olmadığı için bu şekilde slicing (10:14) çalışmaz.\nBunun yerine, indexleri kullanarak satırlara doğrudan erişmek için\n.loc yöntemini kullanman gerekir.'

In [37]:
df.index=np.arange(10,19,2)

In [42]:
df

    var1  var2  var3
10     8     1     2
12     8     6     6
14     5     7     3
16     9     6     1
18     6     6     7

In [44]:
df.loc[10:14]

    var1  var2  var3
10     8     1     2
12     8     6     6
14     5     7     3

In [46]:
df.index=["a","b","c","d","e"]

In [47]:
df

   var1  var2  var3
a     8     1     2
b     8     6     6
c     5     7     3
d     9     6     1
e     6     6     7

In [48]:
df["a":"c"]

   var1  var2  var3
a     8     1     2
b     8     6     6
c     5     7     3

In [49]:
#silme

In [50]:
df.drop("a",axis=0)

   var1  var2  var3
b     8     6     6
c     5     7     3
d     9     6     1
e     6     6     7

In [51]:
df #görüldüğü üzere bir değişiklik olmadı ana dataframe de

   var1  var2  var3
a     8     1     2
b     8     6     6
c     5     7     3
d     9     6     1
e     6     6     7

In [54]:
df.drop("b", axis=0, inplace=True) # inplace ile işlemi kalıcı yaptık

In [55]:
df

   var1  var2  var3
c     5     7     3
d     9     6     1
e     6     6     7

In [56]:
#fanc ile silmek

In [57]:
l=["d","e"]

In [59]:
df.drop(l,axis=0) #axis satır mı sütun mu sileceğimizi söyler

   var1  var2  var3
c     5     7     3

In [64]:
#değişkenler için

In [60]:
df

   var1  var2  var3
c     5     7     3
d     9     6     1
e     6     6     7

In [61]:
"var1" in df

True

In [62]:
l=["var1","var5","var3"]

In [63]:
for i in l:
    print(i in df)

True
False
True

In [65]:
df["var4"]= df["var1"] * df["var2"] #yeni bir deüşken olusturduk

In [66]:
df

   var1  var2  var3  var4
c     5     7     3    35
d     9     6     1    54
e     6     6     7    36

In [67]:
#değişken silmek

In [69]:
df.drop("var4",axis=1)

   var1  var2  var3
c     5     7     3
d     9     6     1
e     6     6     7

In [70]:
df

   var1  var2  var3  var4
c     5     7     3    35
d     9     6     1    54
e     6     6     7    36

In [71]:
df.drop("var4",axis=1,inplace=True)

In [72]:
df

   var1  var2  var3
c     5     7     3
d     9     6     1
e     6     6     7

In [73]:
#fancy ile silmek

In [74]:
l=["var1","var2"]

In [75]:
df.drop(l,axis=1)

   var3
c     3
d     1
e     7